# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

def MyScript (totalhours, wage, bonus):
    athand = (totalhours*wage) + bonus
    return athand

print(MyScript(220,100,500))
